{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "dew",
    "1": "fogsmog",
    "10": "snow",
    "2": "frost",
    "3": "glaze",
    "4": "hail",
    "5": "lightning",
    "6": "rain",
    "7": "rainbow",
    "8": "rime",
    "9": "sandstorm"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "dew": "0",
    "fogsmog": "1",
    "frost": "2",
    "glaze": "3",
    "hail": "4",
    "lightning": "5",
    "rain": "6",
    "rainbow": "7",
    "rime": "8",
    "sandstorm": "9",
    "snow": "10"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.25.1"
}
