{
  "_name_or_path": "dima806/traffic_sign_detection",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Bicycles crossing",
    "1": "Children crossing",
    "2": "Danger Ahead",
    "3": "Dangerous curve to the left",
    "4": "Dangerous curve to the right",
    "5": "Dont Go Left",
    "6": "Dont Go Left or Right",
    "7": "Dont Go Right",
    "8": "Dont Go straight",
    "9": "Dont Go straight or left",
    "10": "Dont overtake from Left",
    "11": "Fences",
    "12": "Go Left",
    "13": "Go Left or right",
    "14": "Go Right",
    "15": "Go left or straight",
    "16": "Go right or straight",
    "17": "Go straight",
    "18": "Go straight or right",
    "19": "Heavy Vehicle Accidents",
    "20": "Horn",
    "21": "No Car",
    "22": "No Uturn",
    "23": "No entry",
    "24": "No horn",
    "25": "No stopping",
    "26": "Road Divider",
    "27": "Roundabout mandatory",
    "28": "Speed limit (15km/h)",
    "29": "Speed limit (30km/h)",
    "30": "Speed limit (40km/h)",
    "31": "Speed limit (50km/h)",
    "32": "Speed limit (5km/h)",
    "33": "Speed limit (60km/h)",
    "34": "Speed limit (70km/h)",
    "35": "Train Crossing",
    "36": "Under Construction",
    "37": "Unknown",
    "38": "Uturn",
    "39": "Zebra Crossing",
    "40": "ZigZag Curve",
    "41": "keep Left",
    "42": "keep Right",
    "43": "speed limit (80km/h)",
    "44": "watch out for cars"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Bicycles crossing": 0,
    "Children crossing": 1,
    "Danger Ahead": 2,
    "Dangerous curve to the left": 3,
    "Dangerous curve to the right": 4,
    "Dont Go Left": 5,
    "Dont Go Left or Right": 6,
    "Dont Go Right": 7,
    "Dont Go straight": 8,
    "Dont Go straight or left": 9,
    "Dont overtake from Left": 10,
    "Fences": 11,
    "Go Left": 12,
    "Go Left or right": 13,
    "Go Right": 14,
    "Go left or straight": 15,
    "Go right or straight": 16,
    "Go straight": 17,
    "Go straight or right": 18,
    "Heavy Vehicle Accidents": 19,
    "Horn": 20,
    "No Car": 21,
    "No Uturn": 22,
    "No entry": 23,
    "No horn": 24,
    "No stopping": 25,
    "Road Divider": 26,
    "Roundabout mandatory": 27,
    "Speed limit (15km/h)": 28,
    "Speed limit (30km/h)": 29,
    "Speed limit (40km/h)": 30,
    "Speed limit (50km/h)": 31,
    "Speed limit (5km/h)": 32,
    "Speed limit (60km/h)": 33,
    "Speed limit (70km/h)": 34,
    "Train Crossing": 35,
    "Under Construction": 36,
    "Unknown": 37,
    "Uturn": 38,
    "Zebra Crossing": 39,
    "ZigZag Curve": 40,
    "keep Left": 41,
    "keep Right": 42,
    "speed limit (80km/h)": 43,
    "watch out for cars": 44
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.40.0"
}
