{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "finetuning_task": "image-classification",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "apple_pie",
    "1": "baby_back_ribs",
    "10": "bruschetta",
    "100": "waffles",
    "11": "caesar_salad",
    "12": "cannoli",
    "13": "caprese_salad",
    "14": "carrot_cake",
    "15": "ceviche",
    "16": "cheese_plate",
    "17": "cheesecake",
    "18": "chicken_curry",
    "19": "chicken_quesadilla",
    "2": "baklava",
    "20": "chicken_wings",
    "21": "chocolate_cake",
    "22": "chocolate_mousse",
    "23": "churros",
    "24": "clam_chowder",
    "25": "club_sandwich",
    "26": "crab_cakes",
    "27": "creme_brulee",
    "28": "croque_madame",
    "29": "cup_cakes",
    "3": "beef_carpaccio",
    "30": "deviled_eggs",
    "31": "donuts",
    "32": "dumplings",
    "33": "edamame",
    "34": "eggs_benedict",
    "35": "escargots",
    "36": "falafel",
    "37": "filet_mignon",
    "38": "fish_and_chips",
    "39": "foie_gras",
    "4": "beef_tartare",
    "40": "french_fries",
    "41": "french_onion_soup",
    "42": "french_toast",
    "43": "fried_calamari",
    "44": "fried_rice",
    "45": "frozen_yogurt",
    "46": "garlic_bread",
    "47": "gnocchi",
    "48": "greek_salad",
    "49": "grilled_cheese_sandwich",
    "5": "beet_salad",
    "50": "grilled_salmon",
    "51": "guacamole",
    "52": "gyoza",
    "53": "hamburger",
    "54": "hot_and_sour_soup",
    "55": "hot_dog",
    "56": "huevos_rancheros",
    "57": "hummus",
    "58": "ice_cream",
    "59": "lasagna",
    "6": "beignets",
    "60": "lobster_bisque",
    "61": "lobster_roll_sandwich",
    "62": "macaroni_and_cheese",
    "63": "macarons",
    "64": "miso_soup",
    "65": "mussels",
    "66": "nachos",
    "67": "omelette",
    "68": "onion_rings",
    "69": "oysters",
    "7": "bibimbap",
    "70": "pad_thai",
    "71": "paella",
    "72": "pancakes",
    "73": "panna_cotta",
    "74": "peking_duck",
    "75": "pho",
    "76": "pizza",
    "77": "pork_chop",
    "78": "poutine",
    "79": "prime_rib",
    "8": "bread_pudding",
    "80": "pulled_pork_sandwich",
    "81": "ramen",
    "82": "ravioli",
    "83": "red_velvet_cake",
    "84": "risotto",
    "85": "samosa",
    "86": "sashimi",
    "87": "scallops",
    "88": "seaweed_salad",
    "89": "shrimp_and_grits",
    "9": "breakfast_burrito",
    "90": "spaghetti_bolognese",
    "91": "spaghetti_carbonara",
    "92": "spring_rolls",
    "93": "steak",
    "94": "strawberry_shortcake",
    "95": "sushi",
    "96": "tacos",
    "97": "takoyaki",
    "98": "tiramisu",
    "99": "tuna_tartare"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "apple_pie": "0",
    "baby_back_ribs": "1",
    "baklava": "2",
    "beef_carpaccio": "3",
    "beef_tartare": "4",
    "beet_salad": "5",
    "beignets": "6",
    "bibimbap": "7",
    "bread_pudding": "8",
    "breakfast_burrito": "9",
    "bruschetta": "10",
    "caesar_salad": "11",
    "cannoli": "12",
    "caprese_salad": "13",
    "carrot_cake": "14",
    "ceviche": "15",
    "cheese_plate": "16",
    "cheesecake": "17",
    "chicken_curry": "18",
    "chicken_quesadilla": "19",
    "chicken_wings": "20",
    "chocolate_cake": "21",
    "chocolate_mousse": "22",
    "churros": "23",
    "clam_chowder": "24",
    "club_sandwich": "25",
    "crab_cakes": "26",
    "creme_brulee": "27",
    "croque_madame": "28",
    "cup_cakes": "29",
    "deviled_eggs": "30",
    "donuts": "31",
    "dumplings": "32",
    "edamame": "33",
    "eggs_benedict": "34",
    "escargots": "35",
    "falafel": "36",
    "filet_mignon": "37",
    "fish_and_chips": "38",
    "foie_gras": "39",
    "french_fries": "40",
    "french_onion_soup": "41",
    "french_toast": "42",
    "fried_calamari": "43",
    "fried_rice": "44",
    "frozen_yogurt": "45",
    "garlic_bread": "46",
    "gnocchi": "47",
    "greek_salad": "48",
    "grilled_cheese_sandwich": "49",
    "grilled_salmon": "50",
    "guacamole": "51",
    "gyoza": "52",
    "hamburger": "53",
    "hot_and_sour_soup": "54",
    "hot_dog": "55",
    "huevos_rancheros": "56",
    "hummus": "57",
    "ice_cream": "58",
    "lasagna": "59",
    "lobster_bisque": "60",
    "lobster_roll_sandwich": "61",
    "macaroni_and_cheese": "62",
    "macarons": "63",
    "miso_soup": "64",
    "mussels": "65",
    "nachos": "66",
    "omelette": "67",
    "onion_rings": "68",
    "oysters": "69",
    "pad_thai": "70",
    "paella": "71",
    "pancakes": "72",
    "panna_cotta": "73",
    "peking_duck": "74",
    "pho": "75",
    "pizza": "76",
    "pork_chop": "77",
    "poutine": "78",
    "prime_rib": "79",
    "pulled_pork_sandwich": "80",
    "ramen": "81",
    "ravioli": "82",
    "red_velvet_cake": "83",
    "risotto": "84",
    "samosa": "85",
    "sashimi": "86",
    "scallops": "87",
    "seaweed_salad": "88",
    "shrimp_and_grits": "89",
    "spaghetti_bolognese": "90",
    "spaghetti_carbonara": "91",
    "spring_rolls": "92",
    "steak": "93",
    "strawberry_shortcake": "94",
    "sushi": "95",
    "tacos": "96",
    "takoyaki": "97",
    "tiramisu": "98",
    "tuna_tartare": "99",
    "waffles": "100"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "torch_dtype": "float32",
  "transformers_version": "4.8.1"
}
